Seeing the same thing. Fortunately there is a workaround -- Here is our terraform plan. note how the resource Id has a `|` with another reference to a particular subscription after it.

```
  # azurerm_role_assignment.ado-service-principal-vnet-peering-vnet01-uat will be created
  + resource "azurerm_role_assignment" "ado-service-principal-vnet-peering-vnet01-uat" {
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = "3defe365-2eb3-41c7-a025-55649d591ede"
      + principal_type                   = (known after apply)
      + role_definition_id               = "/subscriptions/12772dbc-1865-4692-bd55-123903f9727a/providers/Microsoft.Authorization/roleDefinitions/c4a36f19-2ac1-de10-be53-2f72cdd39198|/subscriptions/12772dbc-1865-4692-bd55-123903f9727a"
      + role_definition_name             = (known after apply)
      + scope                            = "/subscriptions/12772dbc-1865-4692-bd55-123903f9727a/resourceGroups/azwe01rg01/providers/Microsoft.Network/virtualNetworks/azwe01vnet01"
      + skip_service_principal_aad_check = (known after apply)
    }
```

I was able to workaround this by splitting on the `|` and using the first part with the actual resource ID. Modifying my resource definition as such:

```hcl
resource "azurerm_role_assignment" "ado-service-principal-vnet-peering-vnet01-uat" {
  scope              = "/subscriptions/${local.subscriptions.prod}/resourceGroups/azwe01rg01/providers/Microsoft.Network/virtualNetworks/azwe01vnet01"
  role_definition_id = split("|", azurerm_role_definition.vnet-peer-manager.id)[0]
  principal_id       = local.azure_dev_ops_service_principals.uat.object_id

  provider = azurerm.dev
}
```